_blog/controlling-latex-export.org
#+LATEX_CLASS: revtex4
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:

* Controlling the latex export in org-mode 8+

The new export engine in org-mode 8 changed a lot of export behavior. Here I try to document how to get what you want. 

#+BEGIN_SRC emacs-lisp :results value
(let ((org-latex-classes '(("article"
			    "\\documentclass{article}"
			    ("\\section{%s}" . "\\section*{%s}")
			    ("\\subsection{%s}" . "\\subsection*{%s}")
			    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
			    ("\\paragraph{%s}" . "\\paragraph*{%s}")
			    ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
      (org-latex-default-packages-alist '()))
  (org-latex-export-to-latex)
  (find-file-noselect "controlling-latex-export.tex")
  (switch-to-buffer "controlling-latex-export.tex")
  (buffer-string))
#+END_SRC



* test								   :noexport:

#+BEGIN_SRC emacs-lisp :results output
(let ((org-latex-classes '(("revtex4"                          ;class-name
			    "\\documentclass{revtex4}"        ; header-string
			    ("\\section{%s}" . "\\section*{%s}")
			    ("\\subsection{%s}" . "\\subsection*{%s}")
			    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
			    ("\\paragraph{%s}" . "\\paragraph*{%s}")
			    ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

      ;; these packages are loaded in the latex file
      (org-latex-default-packages-alist 
       '(("" "natbib" t)
	 ("" "url" t)
	 ("" "graphicx" t)
	 ("" "amsmath" t)))
      (async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil)
      (ext-plist '(:with-author nil				
		   :with-date nil
		   :with-toc nil
		   :exclude-tags '("noexport")
		   :latex-hyperref-p nil)))
  (org-latex-export-to-latex async subtreep visible-only body-only ext-plist))
#+END_SRC

#+RESULTS:



file:controlling-latex-export.tex



